test_bank_mega/app/Controllers/Home.php

    public function fetchData(){
        try {

            $data = $this->KaryawanModel->findAll();
---
SELECT *
FROM "karyawan"

    public function getKaryawan($id){
        try {

            $data = $this->KaryawanModel->find($id);
---
SELECT *
FROM "karyawan"
WHERE "karyawan"."id" = '8'

                $data["id"] = $id;
            }

            $data = $this->KaryawanModel->save($data);
---
INSERT INTO "karyawan" ("nip", "nama", "division") VALUES ('001', 'asd', 'IT')
UPDATE "karyawan" SET "nip" = '001', "nama" = 'asdedit1', "division" = 'IT', "id" = '8'
WHERE "karyawan"."id" IN ('8')

    public function delete($id){
        try {

            $data = $this->KaryawanModel->delete($id);
---
DELETE FROM "karyawan"
WHERE "id" IN ('7')